/* jshint esversion: 6*/

import React from 'react';
import Relay from 'react-relay';

class TermsAndConditions extends React.Component {
    componentDidMount() {
        componentHandler.upgradeDom();
    } 
    render() {
        const style_big_background_image = {
            // TODO: optimize image size
            background: "url('/static/landing_big_bckground_image.jpg') 50% 50% / cover",
            height: "500px",
            marginTop: "0px",
        }
        const style_heading1 = {
            color: "black",
            fontSize: "37px",
            textAlign: "center",
            margin: "1.75rem 0 2.625rem 0",
            fontWeight: "normal"
        }
        const style_heading_text1 = {
            color: "white",
            fontSize: "2.625rem",
            textAlign:"center",
            margin: "1.75rem 0 2.625rem 0"
        }
        return (
            <div>
            <div className="mdl-grid" >
            <div className="mdl-cell mdl-cell--8-col mdl-cell--8-col-tablet mdl-cell--6-col-tablet mdl-cell--4-col-phone" style={{margin:"auto"}}>
            <h1>    תנאי שימוש והבהרות משפטיות. </h1>
            <h2> מבוא: </h2>
                <ul class='mdl-list'>
                    <li class="mdl-list__item">
                        <span class="mdl-list__item-primary-content">תקנון האתר מתייחס לאתר המופיע תחת שם הדומיין לעיל: www.orderoo.co </span>
                    </li>
                    <li class="mdl-list__item">
                        <span class="mdl-list__item-primary-content">בתקנון זה הנהלת האתר לרבות עובדיה, מנהליה, בעליה והפועלים מכוחה או בשמה. </span>
                    </li>
                    <li class="mdl-list__item">
                        <span class="mdl-list__item-primary-content">בכל מקום בתקנון זה בו יופיע המונח "גולש" או "משתמש" הכוונה לאדם העושה שימוש באתר באמצעות רשת האינטרנט לרבות באמצעות תקשורת סלולארית. </span>
                    </li>
                </ul>
                <p>ברוכים הבאים לאתר  orderoo (להלן: "אורדרו" ו/או "האתר"). האתר מנוהל ומופעל על ידי חברת קרייזי דאק בע"מ. 
                </p>
                <p>שימוש באתר ובתכנים המוצגים בו יעשה על ידי המשתמש בהתאם ובכפוף לתנאי השימוש דלהלן. אנא קרא את תנאי השימוש בעיון רב, שכן השימוש באתר או כל חלק ממנו, מהווה הסכמה לכל תנאי השימוש. בחלק ממדורי האתר יתכן ויימצאו תנאי שימוש נוספים המתייחסים במפורט לאותו מדור או שירות. השימוש במדורים ובשירותים אלו כפוף הן לתנאי שימוש באתר כולו והן לתנאים הפרטניים שיימצאו בהם. 
                </p>
                <p>  "תנאי שימוש" מנוסחים בלשון זכר לצרכי נוחות בלבד, ואולם הוא פונה אל נשים וגברים כאחד.</p>
                <p>תנאי השימוש שלהלן מחייבים כל מי שיבחר להשתמש באתר בכל דרך שהיא.</p>
                <p>הכניסה לאתר והשימוש באתר או במידע המצוי בו - מהווים הסכמה של המשתמש לתנאי שימוש אלה.</p>
                <h2>מידע ואחריות:</h2>
                <p> <b>1. </b> Orderoo הנו פורטל אינטרנטי הפועל באתר אינטרנטי ו/או באפליקציה סלולרית וכולל מנוע חיפוש להשוואת מחירים ומערכת הזמנת מוצרים ושירותים באמצעות רשת האינטרנט. מובהר בזאת כי האתר אינו אתר מכירה ו/או חנות מקוונת. המידע המצוי באתר זה נמסר אך ורק לנוחות המבקרים והגולשים באתר.
                </p>
                <p><b>2. </b>להנהלת האתר שיקול הדעת הבלעדי להחליט אילו תכנים כאמור יוצגו באתר, משך הזמן בהם יוצגו, מה יהיה מיקומם ועיצובם וכל עניין אחר הקשור בהצבתם באתר.
                </p>
                <p><b>3. </b>למען הסר ספק מובהר בזאת כי פרטי המוצרים המופיעים באתר ו/או באפליקציה, תיאורם ותכונותיהם לרבות מחירם הרשמי נמסרים כולם על ידי צד ג' (להלן:"הספקים"). האתר אינו יכול ואינו מתיימר לפקח על המידע ומהימנותו והאחריות למידע וטיבו מוטלת כולה על הספקים המציעים באמצעות האתר את מרכולתם.</p>
                <p><b>4. </b>במקרה בו יתגלה כי נפלה טעות במידע המפורסם באתר ו/או באפליקציה תהיה רשאית הנהלת האתר להסירו מן האתר ואולם הנהלת האתר לא תשא עקב כך בכל אחריות.
                </p>
                <p><b>5. </b>הנהלת האתר לא תשא באחריות למידע ותכנים שיתפרסמו באתר על ידי צדדים שלישיים או לכל תוצאה שתנבע מהסתמכות עליהם ו/או שימוש בהם.</p>
                <p><b>6. </b>תמונות המוצרים המופיעים באתר נועדו להמחשה בלבד וייתכנו הבדלים בין התמונה ובין המוצר בפועל. הנהלת האתר ממליצה להתייחס במשנה זהירות ובביקורתיות למידע שמתפרסם באינטרנט, המידע אינו מתפרסם מטעמה של הנהלת האתר, ולפיכך היא אינה אחראית למהימנותו, אמינותו, דיוקו או שלמותו. כל מידע המופיע באתר בין אם המדובר במידע מקצועי ובין אם בכל מידע אחר, אינו מהווה תחליף להתייעצות עם אנשי מקצוע מתאימים ו/או בבדיקת המוצר טרם רכישתו.</p>
                <p><b>7. </b>המידע הנכלל באתר זה נמסר למטרות אינפורמטיביות כלליות בלבד ואינו מהווה או מתיימר להוות הצעה, הזמנה או המלצה לשימוש או לרכישה של כל שירות ו/או מוצר הכלולים באתר וכן אינו מהווה תחליף לייעוץ רפואי, משפטי או מקצועי אחר באשר לזכויות המפורטות בו.</p>
                <p><b>8. </b>למען הסר ספק, מובהר כי צוות Orderoo אוספים את המידע המצוי באתר זה ממקורות המידע השונים הקיימים בשוק, לרבות עלוני שיווק, אנשי מקצוע ומאגרי מידע ממשלתיים ואחרים.  לפיכך מובהר כי יתכן שחלק מן המידע באתר אינו נכון ו/או אינו מדויק ו/או אינו מעודכן, נכון למועד הביקור באתר.</p>
                <p><b>9. </b>הקישורים והמידע לעניין השירותים השונים באתר זה הינם באחריות אותם אתרים או ספקי השירותים. מכל מקום על המשתמש ובאחריותו להתייעץ עם גורם מקצועי רלוונטי לפני קבלת השירות, על מנת לוודא התאמתו לצרכי המשתמש.</p>
                <p><b>10. </b>Orderoo אינה בבחינת "מוציאה לאור" של התוכן שסופק לאתר ע"י צד שלישי. לפיכך, ל Orderoo  אין בקרה עריכתית על תוכן שכזה מעבר לזו שיש לספריה ציבורית, חנות ספרים או דוכן עיתונים. כל חוות דעת, יעוץ, הצהרה, שירותים, הצעה או מידע אחר או תוכן המוצג באתר וסופק ע"י צד שלישי, כולל ספקי מידע, שירותים וסחורות הנם של המחבר/ים, הכותב/ים או הספקים לפי העניין, ולא של החברה. ללא כל אחריות מכל סוג שהוא לתוכן, לנכונותו, למהימנותו ולמידת דיוקו.</p>
                <p><b>11. </b>הנהלת Orderoo רשאית לסרב לפרסם תכנים אשר לדעתה מפרים את תנאי האתר ו/או עלולים לפגוע באתר ו/או בצד שלישי כלשהו, והיא רשאית למחוק תכנים כאלו בכל עת. </p>
                <p><b>12. </b>Orderoo ו/או מי מטעמה לא יישאו באחריות לכל תביעה, דרישה או טענה, מכל מין וסוג, בכל עילה שהיא, ולכל נזק שהוא, ישיר או עקיף, המבוססת על שימוש בנתוני האתר והמידע המתפרסם בו.</p>
                <p><b>13. </b>המידע מוצג באתר לציבור " As Is " Orderoo או מי מטעמה, לא יישאו באחריות לאמיתות המידע. ו/או התאמת המידע לצורכי המשתמש בו. או באשר לאופן בו הוא או צד ג' כלשהו עושה שימוש במידע.</p>
                <p><b>14. </b>אם נפלה טעות קולמוס בתיאור המוצר כפי שהוא מופיע באפליקציה ו/או באתר לרבות טעות במחיר המוצר, לא יחייב הדבר את Orderoo. במקרים כאמור תהא החברה רשאית לבטל את העסקה.</p>
                <p><b>15. </b>Orderoo  ו/או מי מטעמה לא יישאו באחריות לכל נזק שיגרם למי שיבחר להשתמש במידע המצוי באתר, וזאת גם אם יתברר כי מידע זה שגוי, לא מדויק או לא מעודכן. המשתמש במידע מודע לכך, שהמידע שבאתר אינו מדויק ו/או אינו מעודכן, והוא לוקח על עצמו את האחריות לשימוש במידע זה. בכלל זה, המשתמש במידע מוותר על כל טענה, כי Orderoo ו/או מי מטעמה היו צריכים להיות מודעים למידע הנכון, וכי היה עליהם להימנע מלפרסם את המידע כפי שפורסם.</p>
                <p><b>16. </b>Orderoo רשאית לערוך שינויים בדפי אתר זה בתוכנם ובמידע הכלול בהם בכל עת, ללא הודעה מוקדמת.  Orderoo אינה מתחייבת לעדכן את החומר הכלול באתר ו/או אינה מתחייבת לגבי מועדי העדכון.</p>
                <p><b>17. </b>הרשמה לאתר ו/או לאפליקציה מהווה אישור להיכלל ברשימת הלקוחות של החברה ומהווה אישר להימנות ברשימת תפוצת הדיוור הישיר של החברה, לרבות הסכמה לעדכונים, הודעות push , הודעות SMS, והודעות תוכן שיווקי ב Mail .</p>
                <h2>התקשרות עיסקית:</h2>
                <p><b>18. </b>למען הסר ספק, Orderoo אינה מציעה ו/או מוכרת ו/או מספקת מוצרים באתר, האתר משמש כפלטפורמה בלבד המפנה ליצרנים, יבואנים וסיטונאים מחוץ לרשת האינטרנט. לפיכך, כל האחריות למוצרים והשירותים לרבות תכונותיהם ואספקתם, מפרטם הטכני, מועדי אספקתם ותקופות האחריות חלה על הספקים בלבד. מבלי לגרוע מן האמור לעיל יובהר כי גם במקרה של הפרת התחייבות של מי מהספקים לא יהווה הדבר הפרת התחייבות של Orderoo, ולכל גולש תהיה שמורה זכות תביעה ישירה כנגד הספק המפר כאמור, ולא כנגד Orderoo .</p>
                <p><b>19. </b>מובהר בזאת כי בשום אופן לא תהיה הנהלת האתר או מי מטעמה צד לעסקה בין הספק ובין המשתמש והן הספק והן המשתמש יראו את עצמם כמי שהתקשרו עסקית ביניהם באופן ישיר לצורך קניה ו/או מכירת מוצרים ושירותים. Orderoo  לא תהיה צד להסכם בין הספקים ובין המשתמשים ובאישורו הסכם זה מצהיר המשתמש כי מרגע שנוצר קשר עם הספק באופן ישיר, לא תהיה לו כל טענה ו/או דרישה ו/או תביעה ו/או תלונה כנגד Orderoo   בכל הקשור למוצר.</p>
                <p><b>20. </b>להלן יודגש כי ביצוע הזמנה באתר ו/או באפליקציה אינה מהווה אישור של החברה על ביצוע ההזמנה. אישור סופי של ההזמנה וקביעת מועדי הספקה יבוצע רק לאחר קבלת אישור סופי מספק המוצר.</p>
                <p><b>21. </b>המחירים המתפרסמים במדור "השוואת מחירים" אינם מהווים תחליף למחירון הספק. המשתמש באתר מצהיר כי ידוע לו שקיים פער זמנים בין עדכון המחירון אצל הספק, לעדכון המחירים באתר. לכן,  אם קיימת סתירה או חוסר בעדכון בין המידע באתר למחירון, הרי שיש להישמע ולנהוג כלשון המחירון.</p>
                <p><b>22. </b>החברה רשאית להפסיק את השימוש באפליקציה ו/או באתר למשתמש ככל ונעשית ו/או שנעשתה על ידו שימוש בניגוד לכללי השימוש ו/או הוראות הדין, ואולם אין באי הפסקת השימוש בכדי לפטור את המשתמש מאחריות כאמור לעיל ו/או להוות הסכמה לפעולה כאמור.</p>
                <p><b>23. </b>משתמש שיעשה שימוש באפליקציה ו/או באתר בניגוד לכללי השימוש או להוראות הדין יישא לבדו באחריות למעשיו לרבות לכל נזק ישיר ו/או עקיף שיגרם לחברה ו/או לכל אדם אחר, ויהא מחויב לפצות את החברה ולשפות אותה ו/או מי מטעמה בגין כל נזק ישיר ו/או עקיף לרבות הפסד, אבדן רווח, תשלום או הוצאה שיגרמו להם ובכלל זה שכ"ט עו"ד והוצאות משפט.</p>
                <p><b>24. </b>הלקוח יישא באחריות מלאה לנזק מכל סוג שהוא שייגרם לו ו/או לחברה ו/או לצד ג' כלשהו בגין טעות שביצע בהקלדת הנתונים, לרבות, טעות בהקלדת כתובתו, טעות בהקלדת פרטי כרטיס האשראי, טעות בהקלדת כתובת, מועדי ההספקה וכד' להלן- פרטים להזמנה, אספקה, תשלומים וכיוצא באלה.</p>
                <h2>זכויות יוצרים:</h2>
                <p><b>25. </b>כל זכויות הקניין הרוחני, לרבות זכויות היוצרים במידע המצוי באתר זה, שמורות Orderoo  או לצדדים שלישיים.</p>
                <p><b>26. </b>Orderoo מתירה למבקרים באתר זה לצפות במידע המצוי בו ולשמור אותו לצרכים אישיים ובלתי מסחריים בלבד.</p>
                <p><b>27. </b>בכפוף לדיני זכויות היוצרים, אין לשכפל, להעתיק, לפרסם, לשנות או להשתמש בדרך כלשהי בחומר המצוי באתר זה ו/או במידע של- Orderoo או לצדדים שלישיים זכויות יוצרים בו, אלא לאחר קבלת הסכמת  Orderoo או מי מהצדדים השלישיים מראש ובכתב.</p>
                <h2>גישה למדור "השוואת מחירים".</h2>
                <p><b>28. </b>הנהלת האתר שומרת לעצמה את הזכות לקבוע כי הגישה למדור "השוואת מחירים", ו/או חלקים נוספים  מהשירותים והמדורים באתר תהיה מוגבלת לנרשמים כחברים באתר והשימוש בהם יותנה במתן שם משתמש ו/או כתובת דואר אלקטרוני ו/או וסיסמה ו/או בדרך של תשלום כספים בעבור דמי מנוי. להנהלת האתר יהיה שיקול הדעת המוחלט והבלעדי לקבוע אילו שירותים ומדורים יהיו תלויים ברישום כאמור.</p>
                <p><b>29. </b>במידה והנהלת האתר תנהג כאמור בסעיף הקודם, שם המשתמש, כתובת האי-מייל וסיסמת הגישה יהיו אישיים ולא ניתן / יורשה למסור אותם לאדם אחר. </p>
                <p><b>30. </b>הנהלת האתר תהיה רשאית להוסיף או לשנות מעת לעת את כללי הגישה למדורים ולשירותים הנלווים בקבלת שם משתמש, כתובת אי-מייל וסיסמה, או להתנות את הגישה אליהם באישור תנאים נוספים לפי שיקול דעת הנהלת האתר.</p>
                <p><b>31. </b>הנהלת האתר שומרת לעצמה את הזכות לגבות תשלום בעבור השירותים הניתנים על ידה.</p>
                <h2>פרסומות:</h2>
                <p><b>32. </b>Orderoo   הינו אתר הכולל מידע פרסומי הנמסר לפרסום מטעמם של מפרסמים שונים. מידע כזה יכול שיהיה בטקסט, וידאו, תמונות או בקול, ויכול שיהיה באמצעות הודעת Email לחברים רשומים. פרסום מידע מסחרי או פרסומי אינו מהווה המלצה או עידוד לרכוש את המוצרים המוצעים בהם למכירה.</p>
                <p><b>33. </b>הנהלת האתר לא תשא בכל אחריות לתוכן המידע המסחרי או הפרסומות שיפורסמו באתר. הנהלת האתר אינה אחראית לתוכן הפרסומים הללו או אמיתותם. האחריות היחידה לתוכן הפרסומות והמידע המסחרי חלה על המפרסמים.</p>
                <p><b>34. </b>כל עסקה שתיעשה בעקבות מודעה או מידע המתפרסמים באתר תסוכם ישירות בין הרוכש ובין המפרסם הנוגע בדבר. הנהלת האתר לא תהיה צד לכל עסקה כזו, והיא לא תשא באחריות לשירותים ולמוצרים שיוצעו בפרסומות ובמודעות המתפרסמות באתר.</p>
                <h2>קישורים:</h2>
                <p><b>35. </b>קישורים המצויים באתר זה הם לנוחות המשתמש בלבד. Orderoo  ו/או מי מטעמה לא יישאו באחריות בגין הקישור, האתר המקושר, או כל הנובע מכך.</p>
                <p><b>36. </b>Orderoo  ו/או מי מטעמה אינם אחראים לאתרים לגביהם קיים קישור, אין להם שליטה על תוכנם של אתרים אלה, ואין בהופעת הקישור משום מתן גושפנקא או המלצה לאתר או לבעליו.</p>
                <p><b>37. </b>בכל מקרה, כניסה לאתר מקושר הינה באחריות מי שבוחר לעשות כן.  Orderoo ו/או מי מטעמה לא יישאו באחריות כלשהי לכל נזק ישיר או עקיף, שיגרם למי שבוחר להיכנס לאתר מקושר או לצד ג' כלשהו. הבחירה להיכנס לאתר המקושר היא בחירת המשתמש, והסיכון הנובע מכך מוטלת אך ורק עליו.</p>
                <h2>תנאים נוספים:</h2>
                <p><b>38. </b>פרטיותך חשובה לנו. במסגרת הפעלת האתר אנו אוספים מידע מסוגים שונים בקשר לשימושך באתר. מידע זה אינו מזהה אותך אישית ונאסף באופן סטטיסטי בלבד. השימוש במידע זו נועד לשפר וליעל את האתר. בהסכמתך לתנאי השימוש, הנך מרשה ל- Orderoo לעשות שימוש במידע שייאגר אודות שימושך באתר לצורך הפקת וניתוח סטטיסטי והכול בכפוף להוראות החוק.</p>
                <p><b>39. </b>רישומי המחשב בדבר הפעולות המתבצעות באמצעות האפליקציה ו/או האתר יהוו ראיה לכאורה לנכונותם.</p>
                <p><b>40. </b>מען הסר ספק מובהר כי שעון השרת, בו מופעל האתר, יהווה ראיה סופית ומכרעת לעניין שעת אישור ההזמנה על ידי הלקוח באתר ושעת הוצאת החשבון על ידי החברה.</p>
                <h2>שונות:</h2>
                <p><b>41. </b>Orderoo  שומרת לעצמה את הזכות הבלעדית לשנות, למחוק או להוסיף תנאים לתנאי שימוש אלו בכל עת, ללא מתן הודעה מראש, ועל פי שיקול דעתה הבלעדי.</p>
                <p><b>42. </b>המשתמש באתר מתחייב לבדוק מעת לעת את תנאי השימוש באתר על מנת להתעדכן בשינויים בהם, המשתמש לוקח על עצמו את הסיכון הכרוך בהימנעות מבדיקות נוספות כאמור.</p>
                <p><b>43. </b>כל תנאי השימוש אלה יחולו הוראות דיני ישראל בלבד. כל תביעה או הליך משפטי בעניין הקשור באתר זה או הנובע ממנו, יתבררו אך ורק בבית המשפט המוסמך לכך, שמקום שיבתו הוא תל אביב - יפו.</p>
                <h2>הנהלת Orderoo מאחלת לכל הגולשים והמשתמשים באתר שימוש יעיל ופורה.</h2>
            </div>
            </div>

            
            
            </div>
        );
    }
}

export default TermsAndConditions
